### Terraform Apply ✅ Succeeded

<details><summary>Show apply output</summary>

```
module.devops.tls_private_key.ssh_key: Refreshing state... [id=e258ae1e311871c57d4f60314821c86a618c855b]
module.devops.tls_private_key.ssh_key_customer: Refreshing state... [id=fa3faeff01a53fb23eba3ca1813c2b628bf0635c]
module.devops.aws_ssm_parameter.github_token: Refreshing state... [id=/devops/github_token]
module.devops.aws_route53_zone.my_domain: Refreshing state... [id=Z01823541YF2W4LAQSP9W]
module.devops.aws_key_pair.ec2_key_pair: Refreshing state... [id=aws_flyflow_generated]
module.devops.module.ec2.aws_iam_role.ecs_instance_role: Refreshing state... [id=ecsInstanceRoleFinal]
module.devops.aws_s3_bucket.flyflow_artifact_bucket: Refreshing state... [id=flyflow-artifacts-staging]
module.devops.aws_dynamodb_table.tfstate_locking: Refreshing state... [id=tfstate-locking-new]
module.devops.aws_ssm_parameter.public_key: Refreshing state... [id=/key_pairs/aws_flyflow/public_key]
module.devops.aws_ssm_parameter.customer_account_id: Refreshing state... [id=/shared/application/ec2/aws-account-id]
module.devops.aws_s3_bucket.jenkins_backup: Refreshing state... [id=flyflow-jenkins-backup-staging]
module.devops.aws_ssm_parameter.aws_secret_key: Refreshing state... [id=/devops/aws_secret_key]
module.devops.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-east-1:580186901909:cluster/flyflow-ecs-staging]
module.devops.aws_ssm_parameter.public_key_customer: Refreshing state... [id=/shared/flyflow_customers/public_key]
module.devops.aws_key_pair.ec2_key_pair_customer: Refreshing state... [id=customers_aws_key]
module.devops.aws_s3_bucket.grafana_backup: Refreshing state... [id=flyflow-grafana-backups-staging]
module.devops.module.ec2.aws_security_group.ecs_sg: Refreshing state... [id=sg-0cce653f2df457d02]
module.devops.aws_ssm_parameter.private_key: Refreshing state... [id=/key_pairs/flyflow/private_key]
module.devops.aws_ssm_parameter.aws_access_key_id: Refreshing state... [id=/devops/aws_access_key_id]
module.devops.aws_security_group.allow_ssh_customers: Refreshing state... [id=sg-06f9e598ebaab5538]
module.devops.aws_route53_record.cname_record: Refreshing state... [id=Z01823541YF2W4LAQSP9W_www.flyflow.io_CNAME]
module.devops.aws_ssm_parameter.route53_nameservers: Refreshing state... [id=/route53/nameservers]
module.devops.aws_route53_record.jenkins_subdomain: Refreshing state... [id=Z01823541YF2W4LAQSP9W_jenkins.flyflow.io_A]
module.devops.aws_ssm_parameter.customer_sg: Refreshing state... [id=/shared/application/ec2/server-sg]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_REGION"]: Refreshing state... [id=auth-service:AWS_REGION]
module.devops.github_actions_secret.shared_secrets["auth-service.ARTIFACT_BUCKET"]: Refreshing state... [id=auth-service:ARTIFACT_BUCKET]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=auth-service:AWS_SECRET_ACCESS_KEY]
module.devops.github_actions_secret.shared_secrets["auth-service.AWS_ACCESS_KEY_ID"]: Refreshing state... [id=auth-service:AWS_ACCESS_KEY_ID]
module.devops.github_actions_secret.shared_secrets["auth-service.GH_FLYFLOW_TOKEN"]: Refreshing state... [id=auth-service:GH_FLYFLOW_TOKEN]
module.devops.aws_s3_bucket_versioning.versioning: Refreshing state... [id=flyflow-jenkins-backup-staging]
module.devops.aws_iam_policy.jenkins_s3_policy: Refreshing state... [id=arn:aws:iam::580186901909:policy/jenkins-s3-backup-policy]
module.devops.aws_s3_bucket_versioning.grafana_versioning: Refreshing state... [id=flyflow-grafana-backups-staging]
module.devops.aws_iam_policy.grafana_s3_policy: Refreshing state... [id=arn:aws:iam::580186901909:policy/grafana-s3-backup-policy]
module.devops.module.ec2.aws_iam_role_policy_attachment.ecs_instance_policy: Refreshing state... [id=ecsInstanceRoleFinal-20251229205225895500000002]
module.devops.module.ec2.aws_iam_instance_profile.ecs_instance_profile: Refreshing state... [id=ecsInstanceProfile]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Refreshing state... [id=i-0c3d7df26d9a6b986]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.devops.aws_ecr_repository.auth_service will be created
  + resource "aws_ecr_repository" "auth_service" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "auth-service-staging"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.ARTIFACT_BUCKET"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flyflow-terraform-apps"
      + secret_name     = "ARTIFACT_BUCKET"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_ACCESS_KEY_ID"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flyflow-terraform-apps"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_REGION"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flyflow-terraform-apps"
      + secret_name     = "AWS_REGION"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_SECRET_ACCESS_KEY"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flyflow-terraform-apps"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.GH_FLYFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flyflow-terraform-apps"
      + secret_name     = "GH_FLYFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.devops.module.ec2.aws_instance.ecs_instance[0] must be replaced
-/+ resource "aws_instance" "ecs_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:580186901909:instance/i-0c3d7df26d9a6b986" -> (known after apply)
      ~ availability_zone                    = "us-east-1d" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0c3d7df26d9a6b986" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0c2d07883f257cecf" -> (known after apply)
      ~ private_dns                          = "ip-172-31-95-14.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.95.14" -> (known after apply)
      ~ public_dns                           = "ec2-18-212-194-107.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.212.194.107" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          - "terraform-20251229205224083500000001",
          + "sg-0cce653f2df457d02",
        ]
        tags                                 = {
            "Name" = "flyflow-ecs-staging"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0cce653f2df457d02",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-03bc9a6f8006d0883" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 7 to add, 0 to change, 1 to destroy.
module.devops.aws_ecr_repository.auth_service: Creating...
module.devops.module.ec2.aws_instance.ecs_instance[0]: Destroying... [id=i-0c3d7df26d9a6b986]
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.GH_FLYFLOW_TOKEN"]: Creating...
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.ARTIFACT_BUCKET"]: Creating...
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_ACCESS_KEY_ID"]: Creating...
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_SECRET_ACCESS_KEY"]: Creating...
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_REGION"]: Creating...
module.devops.aws_ecr_repository.auth_service: Creation complete after 1s [id=auth-service-staging]
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.GH_FLYFLOW_TOKEN"]: Creation complete after 6s [id=flyflow-terraform-apps:GH_FLYFLOW_TOKEN]
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_REGION"]: Creation complete after 6s [id=flyflow-terraform-apps:AWS_REGION]
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_SECRET_ACCESS_KEY"]: Creation complete after 6s [id=flyflow-terraform-apps:AWS_SECRET_ACCESS_KEY]
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.ARTIFACT_BUCKET"]: Creation complete after 7s [id=flyflow-terraform-apps:ARTIFACT_BUCKET]
module.devops.github_actions_secret.shared_secrets["flyflow-terraform-apps.AWS_ACCESS_KEY_ID"]: Creation complete after 7s [id=flyflow-terraform-apps:AWS_ACCESS_KEY_ID]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still destroying... [id=i-0c3d7df26d9a6b986, 10s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still destroying... [id=i-0c3d7df26d9a6b986, 20s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still destroying... [id=i-0c3d7df26d9a6b986, 30s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still destroying... [id=i-0c3d7df26d9a6b986, 40s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still destroying... [id=i-0c3d7df26d9a6b986, 50s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still destroying... [id=i-0c3d7df26d9a6b986, 1m0s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Destruction complete after 1m1s
module.devops.module.ec2.aws_instance.ecs_instance[0]: Creating...
module.devops.module.ec2.aws_instance.ecs_instance[0]: Still creating... [10s elapsed]
module.devops.module.ec2.aws_instance.ecs_instance[0]: Creation complete after 13s [id=i-0c047c32639070846]

Apply complete! Resources: 7 added, 0 changed, 1 destroyed.

```
</details>